# Working with Multiple Tables

In [29]:
import mysql.connector as mysql 
import os 
from dotenv import load_dotenv
import sqlalchemy

In [35]:
# !docker stop mysql-container
# !docker start mysql-container
# !docker ps

mysql-container
mysql-container
CONTAINER ID   IMAGE     COMMAND                  CREATED      STATUS                  PORTS                                                  NAMES
50e33c579e3f   mysql     "docker-entrypoint.sâ€¦"   2 days ago   Up Less than a second   0.0.0.0:3306->3306/tcp, :::3306->3306/tcp, 33060/tcp   mysql-container

In [37]:
load_dotenv('/workspaces/IBM-DS-Course/.env')
user = os.getenv('USER')
password = os.getenv('PASSWORD')
host = 'localhost'
port = 3306
db = 'HR'

In [38]:
conn = mysql.connect(
    host=host,
    user=user,
    password=password,
    port=port
)
cursor = conn.cursor()

In [41]:
use = f'USE {db}'
cursor.execute(use)

## Accessing multiple tables with sub-queries

1. Retrieve only the EMPLOYEES records corresponding to jobs in the JOBS table.

For such a question, you can implement the sub-query in the WHERE clause, such that the overlapping column of JOD ID can identify the required entries.

In [43]:
q1 = "SELECT * FROM EMPLOYEES WHERE JOB_ID IN (SELECT JOB_IDENT FROM JOBS);"
cursor.execute(q1)
output1 = cursor.fetchall()

In [45]:
print(*[row for row in output1],sep='\n')

('E1001', 'John', 'Thomas', 123456, '1976-09-01', 'M', '5631 Rice, OakPark,IL', 100, 100000, 30001, 2)
('E1002', 'Alice', 'James', 123457, '1972-07-31', 'F', '980 Berry ln, Elgin,IL', 200, 80000, 30002, 5)
('E1003', 'Steve', 'Wells', 123458, '1980-10-08', 'M', '291 Springs, Gary,IL', 300, 50000, 30002, 5)
('E1004', 'Santosh', 'Kumar', 123459, '1985-07-20', 'M', '511 Aurora Av, Aurora,IL', 400, 60000, 30002, 5)
('E1005', 'Ahmed', 'Hussain', 123410, '1981-04-01', 'M', '216 Oak Tree, Geneva,IL', 500, 70000, 30001, 2)
('E1006', 'Nancy', 'Allen', 123411, '1978-06-02', 'F', '111 Green Pl, Elgin,IL', 600, 90000, 30001, 2)
('E1007', 'Mary', 'Thomas', 123412, '1975-05-05', 'F', '100 Rose Pl, Gary,IL', 650, 65000, 30003, 7)
('E1008', 'Bharath', 'Gupta', 123413, '1985-06-05', 'M', '145 Berry Ln, Naperville,IL', 660, 65000, 30003, 7)
('E1009', 'Andrea', 'Jones', 123414, '1990-09-07', 'F', '120 Fall Creek, Gary,IL', 234, 70000, 30003, 7)
('E1010', 'Ann', 'Jacob', 123415, '1982-03-30', 'F', '111 Britany Springs,Elgin,IL', 220, 70000, 30002, 5)

2. Retrieve JOB information for employees earning over $70,000.

For this example, retrieve the details from the JOBS table, which has common IDs with those available in the EMPLOYEES table, provided the salary in the EMPLOYEES table is greater than $70,000. You can write the query as:

In [46]:
q2 = '''SELECT JOB_TITLE, MIN_SALARY, MAX_SALARY, JOB_IDENT
FROM JOBS
WHERE JOB_IDENT IN (select JOB_ID from EMPLOYEES where SALARY > 70000 );'''
cursor.execute(q2)
output2 = cursor.fetchall()
print(*[row for row in output2], sep ='\n')

('Sr. Architect', 60000, 100000, 100)
('Sr. Software Developer', 60000, 80000, 200)
('Lead Architect', 70000, 100000, 600)

## Accessing multiple tables with Implicit Joins

1. Retrieve only the EMPLOYEES records corresponding to jobs in the JOBS table.

The same question as before, but now we will use Implicit Join to retrieve the required information. For this, you will combine the tables based on job IDs. Using the following query for this:

In [48]:
q3 = '''SELECT *
FROM EMPLOYEES, JOBS
WHERE EMPLOYEES.JOB_ID = JOBS.JOB_IDENT;'''
cursor.execute(q3)
output3 = cursor.fetchall()
print(*[row for row in output3], sep='\n')

('E1001', 'John', 'Thomas', 123456, '1976-09-01', 'M', '5631 Rice, OakPark,IL', 100, 100000, 30001, 2, 100, 'Sr. Architect', 60000, 100000)
('E1002', 'Alice', 'James', 123457, '1972-07-31', 'F', '980 Berry ln, Elgin,IL', 200, 80000, 30002, 5, 200, 'Sr. Software Developer', 60000, 80000)
('E1003', 'Steve', 'Wells', 123458, '1980-10-08', 'M', '291 Springs, Gary,IL', 300, 50000, 30002, 5, 300, 'Jr.Software Developer', 40000, 60000)
('E1004', 'Santosh', 'Kumar', 123459, '1985-07-20', 'M', '511 Aurora Av, Aurora,IL', 400, 60000, 30002, 5, 400, 'Jr.Software Developer', 40000, 60000)
('E1005', 'Ahmed', 'Hussain', 123410, '1981-04-01', 'M', '216 Oak Tree, Geneva,IL', 500, 70000, 30001, 2, 500, 'Jr. Architect', 50000, 70000)
('E1006', 'Nancy', 'Allen', 123411, '1978-06-02', 'F', '111 Green Pl, Elgin,IL', 600, 90000, 30001, 2, 600, 'Lead Architect', 70000, 100000)
('E1007', 'Mary', 'Thomas', 123412, '1975-05-05', 'F', '100 Rose Pl, Gary,IL', 650, 65000, 30003, 7, 650, 'Jr. Designer', 60000, 70000)
('E1008', 'Bharath', 'Gupta', 123413, '1985-06-05', 'M', '145 Berry Ln, Naperville,IL', 660, 65000, 30003, 7, 660, 'Jr. Designer', 60000, 70000)
('E1009', 'Andrea', 'Jones', 123414, '1990-09-07', 'F', '120 Fall Creek, Gary,IL', 234, 70000, 30003, 7, 234, 'Sr. Designer', 70000, 90000)
('E1010', 'Ann', 'Jacob', 123415, '1982-03-30', 'F', '111 Britany Springs,Elgin,IL', 220, 70000, 30002, 5, 220, 'Sr. Designer', 70000, 90000)

2. Redo the previous query using shorter aliases for table names.

Note that the tables in question can be assigned shorter aliases. This is especially helpful in cases where specific columns are to be accessed from different tables. The query would be modified to:

In [51]:
q4 = '''SELECT *
FROM EMPLOYEES E, JOBS J
WHERE E.JOB_ID = J.JOB_IDENT;'''
cursor.execute(q4)
output4 = cursor.fetchall()
print(*[row for row in output4], sep='\n')

('E1001', 'John', 'Thomas', 123456, '1976-09-01', 'M', '5631 Rice, OakPark,IL', 100, 100000, 30001, 2, 100, 'Sr. Architect', 60000, 100000)
('E1002', 'Alice', 'James', 123457, '1972-07-31', 'F', '980 Berry ln, Elgin,IL', 200, 80000, 30002, 5, 200, 'Sr. Software Developer', 60000, 80000)
('E1003', 'Steve', 'Wells', 123458, '1980-10-08', 'M', '291 Springs, Gary,IL', 300, 50000, 30002, 5, 300, 'Jr.Software Developer', 40000, 60000)
('E1004', 'Santosh', 'Kumar', 123459, '1985-07-20', 'M', '511 Aurora Av, Aurora,IL', 400, 60000, 30002, 5, 400, 'Jr.Software Developer', 40000, 60000)
('E1005', 'Ahmed', 'Hussain', 123410, '1981-04-01', 'M', '216 Oak Tree, Geneva,IL', 500, 70000, 30001, 2, 500, 'Jr. Architect', 50000, 70000)
('E1006', 'Nancy', 'Allen', 123411, '1978-06-02', 'F', '111 Green Pl, Elgin,IL', 600, 90000, 30001, 2, 600, 'Lead Architect', 70000, 100000)
('E1007', 'Mary', 'Thomas', 123412, '1975-05-05', 'F', '100 Rose Pl, Gary,IL', 650, 65000, 30003, 7, 650, 'Jr. Designer', 60000, 70000)
('E1008', 'Bharath', 'Gupta', 123413, '1985-06-05', 'M', '145 Berry Ln, Naperville,IL', 660, 65000, 30003, 7, 660, 'Jr. Designer', 60000, 70000)
('E1009', 'Andrea', 'Jones', 123414, '1990-09-07', 'F', '120 Fall Creek, Gary,IL', 234, 70000, 30003, 7, 234, 'Sr. Designer', 70000, 90000)
('E1010', 'Ann', 'Jacob', 123415, '1982-03-30', 'F', '111 Britany Springs,Elgin,IL', 220, 70000, 30002, 5, 220, 'Sr. Designer', 70000, 90000)

3. In the previous query, retrieve only the Employee ID, Name, and Job Title.

Notice that Job Title is a column of the JOBS table, and other details are coming from the EMPLOYEES table. The two tables will be joined on Job ID. The query would be as follows:

In [52]:
q5 = '''SELECT EMP_ID,F_NAME,L_NAME, JOB_TITLE
FROM EMPLOYEES E, JOBS J
WHERE E.JOB_ID = J.JOB_IDENT;'''
cursor.execute(q5)
output5 = cursor.fetchall()
print(*[row for row in output5], sep='\n')

('E1001', 'John', 'Thomas', 'Sr. Architect')
('E1002', 'Alice', 'James', 'Sr. Software Developer')
('E1003', 'Steve', 'Wells', 'Jr.Software Developer')
('E1004', 'Santosh', 'Kumar', 'Jr.Software Developer')
('E1005', 'Ahmed', 'Hussain', 'Jr. Architect')
('E1006', 'Nancy', 'Allen', 'Lead Architect')
('E1007', 'Mary', 'Thomas', 'Jr. Designer')
('E1008', 'Bharath', 'Gupta', 'Jr. Designer')
('E1009', 'Andrea', 'Jones', 'Sr. Designer')
('E1010', 'Ann', 'Jacob', 'Sr. Designer')

4. Redo the previous query, but specify the fully qualified column names with aliases in the SELECT clause.

The column names can also be prefixed with table aliases to keep track of where each column is coming from. The above query will be modified as shown below.

In [55]:
q6 = '''SELECT E.EMP_ID, E.F_NAME, E.L_NAME, J.JOB_TITLE
FROM EMPLOYEES E, JOBS J
WHERE E.JOB_ID = J.JOB_IDENT;'''
cursor.execute(q6)
output6 = cursor.fetchall()
print(*[row for row in output6], sep='\n')

('E1001', 'John', 'Thomas', 'Sr. Architect')
('E1002', 'Alice', 'James', 'Sr. Software Developer')
('E1003', 'Steve', 'Wells', 'Jr.Software Developer')
('E1004', 'Santosh', 'Kumar', 'Jr.Software Developer')
('E1005', 'Ahmed', 'Hussain', 'Jr. Architect')
('E1006', 'Nancy', 'Allen', 'Lead Architect')
('E1007', 'Mary', 'Thomas', 'Jr. Designer')
('E1008', 'Bharath', 'Gupta', 'Jr. Designer')
('E1009', 'Andrea', 'Jones', 'Sr. Designer')
('E1010', 'Ann', 'Jacob', 'Sr. Designer')

## Practice problems

1. Retrieve only the list of employees whose JOB_TITLE is Jr. Designer.

a. Using sub-queries

In [58]:
p1 = '''SELECT *
FROM EMPLOYEES \
WHERE JOB_ID IN (
    SELECT JOB_IDENT
    FROM JOBS
    WHERE JOB_TITLE= 'Jr. Designer');'''
cursor.execute(p1)
ans1 = cursor.fetchall()
print(*[row for row in ans1], sep='\n')

('E1007', 'Mary', 'Thomas', 123412, '1975-05-05', 'F', '100 Rose Pl, Gary,IL', 650, 65000, 30003, 7)
('E1008', 'Bharath', 'Gupta', 123413, '1985-06-05', 'M', '145 Berry Ln, Naperville,IL', 660, 65000, 30003, 7)

b. Using Implicit Joins

In [60]:
p2 = '''SELECT *
FROM EMPLOYEES E, JOBS J
WHERE E.JOB_ID = J.JOB_IDENT AND J.JOB_TITLE= 'Jr. Designer';'''
cursor.execute(p2)
ans2 = cursor.fetchall()
print(*[row for row in ans2], sep='\n')

('E1007', 'Mary', 'Thomas', 123412, '1975-05-05', 'F', '100 Rose Pl, Gary,IL', 650, 65000, 30003, 7, 650, 'Jr. Designer', 60000, 70000)
('E1008', 'Bharath', 'Gupta', 123413, '1985-06-05', 'M', '145 Berry Ln, Naperville,IL', 660, 65000, 30003, 7, 660, 'Jr. Designer', 60000, 70000)

2. Retrieve JOB information and a list of employees whose birth year is after 1976.

a. Using sub-queries

In [61]:
p3 = '''SELECT JOB_TITLE, MIN_SALARY, MAX_SALARY, JOB_IDENT
FROM JOBS
WHERE JOB_IDENT IN (SELECT JOB_ID
                    FROM EMPLOYEES
                    WHERE YEAR(B_DATE)>1976 );'''
cursor.execute(p3)
ans3 = cursor.fetchall()
print(*[row for row in ans3], sep='\n')

('Jr.Software Developer', 40000, 60000, 300)
('Jr.Software Developer', 40000, 60000, 400)
('Jr. Architect', 50000, 70000, 500)
('Lead Architect', 70000, 100000, 600)
('Jr. Designer', 60000, 70000, 660)
('Sr. Designer', 70000, 90000, 234)
('Sr. Designer', 70000, 90000, 220)

b. Using implicit join

In [62]:
p4 = '''SELECT J.JOB_TITLE, J.MIN_SALARY, J.MAX_SALARY, J.JOB_IDENT
FROM JOBS J, EMPLOYEES E
WHERE E.JOB_ID = J.JOB_IDENT AND YEAR(E.B_DATE)>1976;'''
cursor.execute(p4)
ans4 = cursor.fetchall()
print(*[row for row in ans4], sep='\n')

('Jr.Software Developer', 40000, 60000, 300)
('Jr.Software Developer', 40000, 60000, 400)
('Jr. Architect', 50000, 70000, 500)
('Lead Architect', 70000, 100000, 600)
('Jr. Designer', 60000, 70000, 660)
('Sr. Designer', 70000, 90000, 234)
('Sr. Designer', 70000, 90000, 220)

In [63]:
conn.close()